Autodesk.Revit.DB.Electrical.ElectricalAnalyticalNodeType
The type of electrical analytical node.
Since:
2023

Autodesk.Revit.DB.Electrical.ElectricalAnalyticalNodeType.EquipmentLoad
Equipment Load

Autodesk.Revit.DB.Electrical.ElectricalAnalyticalNodeType.TransferSwitch
Transfer Switch

Autodesk.Revit.DB.Electrical.ElectricalAnalyticalNodeType.Transformer
Transformer

Autodesk.Revit.DB.Electrical.ElectricalAnalyticalNodeType.Bus
Bus

Autodesk.Revit.DB.Electrical.ElectricalAnalyticalNodeType.PowerSource
Power Source